{ "translations": {
    "Unknown admin setting: \"%1$s\"" : "إعدادات المدير مجهولة: \"%1$s\"",
    "The admin setting \"%1$s\" is read-only" : "إعدادات المدير \"%1$s\" للقراءة فقط",
    "Scheme of external URL must be one of \"http\" or \"https\", but nothing was specified." : "مخطط العنوان الخارجي URL يجب أن يكون إمّا \"http\"  أو  \"https\"، لكن لم يتم تعيين أيّاً منها",
    "Scheme of external URL must be one of \"http\" or \"https\", \"%s\" given." : "مخطط العنوان الخارجي URL يجب أن يكون إمّا \"http\" أو \"https\"، \"%s\" مُعيّن.",
    "Host-part of external URL seems to be empty" : "خانة اسم المضيف في عنوان URLالخارجي تبدو فارغة",
    "Value \"%1$s\" for setting \"%2$s\" is either not convertible to integer or out of range (minimum is %d seconds)." : "القيمة  \"%1$s\"  في الإعداد \"%2$s\" هي إمّا غير قابلة للتحويل إلى عدد صحيح، و إما هي خارج النطاق ( حيث الحد الأدنى هو \"%d\" ثوانٍ).",
    "Value \"%1$s\" for setting \"%2$s\" is not convertible to boolean." : "القيمة \"%1$s\"  في الإعداد \"%2$s\" لا يمكن تحويلها إلى قيمة بوليان \"منطقية\".",
    "true" : "صحيح",
    "false" : "خطأ",
    "DokuWiki Integration" : "مكاملة دوكو ويكي DocuWiki",
    "Installation problem; the required resource \"%1$s\" of type \"%2$s\" is not installed on the server, please contact the system administrator!" : "مشكلة في التنصيب؛ المورد المطلوب \"%1$s\" من نوع \"%2$s\"  لم يتم تنصيبه على المُخدّم، يرجى الاتصال مع مدير النظام!",
    "User" : "مستخدم",
    "Password" : "كلمة المرور",
    "Login succeeded." : "تمّ الدخول بنجاح.",
    "Login failed." : "فشل عملية الدخول.",
    "Error, caught an exception." : "خطأ نتج عنه توليد استثناء.",
    "Caused by previous exception" : "ناتج عن استنثاء سابق",
    "DokuWiki" : "دوكو ويكي",
    "Embed an existing DokuWiki instance into Nextcloud, potentially with SSO." : "ضمّن الدوكو ويكي في نكست كلاود باستخدام النفاذ الموحد SSO.",
    "Embed an existing DokuWiki instance into Nextcloud, potentially with SSO. For SSO DokuWiki users and Nextcloud users have to coincide, e.g. by using a common authentication backend like LDAP, or with an appropriate auth plugin on either side of the integration." : "ضمّن دوكو ويكي الشغالة حالياً في نيكست كلاود،  و ذلك باستخدام النفاذ الموحد SSO. مُعرّفات الدخول لمستخدمي دوكو ويكي عن طريق النفاذ الموحد و مستخدمي نكست كلاود يجب أن تكون متطابقة. على سبيل المثال، باستخدام خلفية مشتركة للتحقّق من الشخصية مثل LDAP، أو باستخدام قابسة التحقّق plugin المناسبة من أحد الطرفين المتكاملين.  ",
    "DokuWiki Installation Path" : "مسار تنصيب دوكو ويكي DokuWiki",
    "Please enter the location of the already installed DokuWiki instance. This should either be a path, absolute or relative to the root of the web server, or a complete URL pointing to the web location of the DokuWiki. In order to make things work, your have to enable the XML-RPC protocol in your DokuWiki." : "الرجاء إدخال موقع نسخة DokuWiki المثبتة بالفعل. يجب أن يكون هذا إما مسارًا مطلقًا أو متعلقًا بجذر خادم الويب، أو عنوان URL كاملًا يشير إلى موقع الويب الخاص بـ DokuWiki. لكي تسير الأمور على ما يرام، عليك تمكين بروتوكول XML-RPC في DokuWiki الخاص بك.",
    "DokuWiki Session Refresh Interval [s]" : "طول فترة إنعاش جلسة العمل في [دوكو ويكي]. ",
    "Please enter the desired session-refresh interval here. The interval is measured in seconds and should be somewhat smaller than the configured session life-time for the DokuWiki instance in use." : "رجاءً أدخل مقدار فترة إنعاش جلسة العمل هنا. تُحتسب الفترة بالثواني و يجب أن تكون أصغر من فترة طول جلسة العمل المسجلة في إعداد الدوكو ويكي. ",
    "Disable SSL verification, e.g. for self-signed certificates or known mis-matching host-names like 'localhost'." : "أوقف التحقق باستخدام SSL لأسباب قد يكون من بينها: شهادات مصادقة ذاتياً أو أسماء مضيف غير مطابقة مثل 'localhost'.",
    "Enable SSL verification." : "تمكين التحقق باستخدام SSL.",
    "Unknown error :(" : "خطأ غير محدد :(",
    "Error" : "خطأ",
    "Links to wiki pages are disabled in preview mode." : "الروابط إلى صفحات الويكي تكون غير مفعّلة في حالة المعاينة preview.",
    "Link to wiki page" : "رابط إلى صفحة ويكي",
    "Links to media files are disabled in preview mode." : "الروابط إلى ملفات الميديا تكون غير مفعلة في حالة المعاينة."
},"pluralForm" :"nplurals=6; plural=n==0 ? 0 : n==1 ? 1 : n==2 ? 2 : n%100>=3 && n%100<=10 ? 3 : n%100>=11 && n%100<=99 ? 4 : 5;"
}