{ "translations": {
    "Unknown admin setting: \"%1$s\"" : "Configuración de administrador desconocida: \"%1$s\"",
    "The admin setting \"%1$s\" is read-only" : "La configuración de administrador \"%1$s\" es de solo lectura",
    "Scheme of external URL must be one of \"http\" or \"https\", but nothing was specified." : "El esquema de la URL externa debe ser uno de \"http\" o \"https\", pero no se especificó nada.",
    "Scheme of external URL must be one of \"http\" or \"https\", \"%s\" given." : "El esquema de la URL externa debe ser uno de \"http\" o \"https\", \"%s\" proporcionado.",
    "Host-part of external URL seems to be empty" : "La parte de host de la URL externa parece estar vacía.",
    "Value \"%1$s\" for setting \"%2$s\" is either not convertible to integer or out of range (minimum is %d seconds)." : "El valor \"%1$s\" para la configuración \"%2$s\" no es convertible a un entero o está fuera del rango permitido (el mínimo es %d segundos).",
    "Value \"%1$s\" for setting \"%2$s\" is not convertible to boolean." : "El valor \"%1$s\" para la configuración \"%2$s\" no se puede convertir a booleano.",
    "true" : "verdadero",
    "false" : "falso",
    "DokuWiki Integration" : "Integración de DokuWiki",
    "Installation problem; the required resource \"%1$s\" of type \"%2$s\" is not installed on the server, please contact the system administrator!" : "Problema de instalación; el recurso requerido \"%1$s\" del tipo \"%2$s\" no está instalado en el servidor, ¡póngase en contacto con el administrador del sistema!",
    "Error, caught an exception." : "Error, se detectó una excepción.",
    "Caused by previous exception" : "Provocado por una excepción anterior",
    "DokuWiki" : "DokuWiki",
    "Embed an existing DokuWiki instance into Nextcloud, potentially with SSO." : "Inserta una instancia existente de DokuWiki dentro de Nextcloud, potencialmente con SSO (Single Sign-On).",
    "Embed an existing DokuWiki instance into Nextcloud, potentially with SSO. For SSO DokuWiki users and Nextcloud users have to coincide, e.g. by using a common authentication backend like LDAP, or with an appropriate auth plugin on either side of the integration." : "Inserta una instancia existente de DokuWiki dentro de Nextcloud, potencialmente con SSO. Para SSO, los usuarios de DokuWiki y los usuarios de Nextcloud deben coincidir, por ejemplo, mediante el uso de un backend de autenticación común como LDAP, o con un complemento de autenticación adecuado en cualquiera de los lados de la integración.",
    "DokuWiki Installation Path" : "Ruta de instalación de DokuWiki",
    "Please enter the location of the already installed DokuWiki instance. This should either be a path, absolute or relative to the root of the web server, or a complete URL pointing to the web location of the DokuWiki. In order to make things work, your have to enable the XML-RPC protocol in your DokuWiki." : "Por favor, ingresa la ubicación de la instancia de DokuWiki ya instalada. Esto debe ser una ruta, absoluta o relativa a la raíz del servidor web, o una URL completa que apunte a la ubicación web de DokuWiki. Para que las cosas funcionen, debes habilitar el protocolo XML-RPC en tu DokuWiki.",
    "DokuWiki Session Refresh Interval [s]" : "Intervalo de actualización de sesión de DokuWiki [s]",
    "Please enter the desired session-refresh interval here. The interval is measured in seconds and should be somewhat smaller than the configured session life-time for the DokuWiki instance in use." : "Por favor, ingresa aquí el intervalo de actualización de sesión deseado. El intervalo se mide en segundos y debe ser un poco más corto que el tiempo de vida de sesión configurado para la instancia de DokuWiki en uso.",
    "Disable SSL verification, e.g. for self-signed certificates or known mis-matching host-names like 'localhost'." : "Deshabilitar la verificación SSL, por ejemplo, para certificados autofirmados o nombres de host con errores conocidos, como 'localhost'.",
    "Enable SSL verification." : "Habilitar verificación SSL.",
    "Unknown error :(" : "Error desconocido :(",
    "Error" : "Error",
    "Links to wiki pages are disabled in preview mode." : "Los enlaces a las páginas del wiki están deshabilitados en el modo de vista previa.",
    "Link to wiki page" : "Enlace a la página del wiki",
    "Links to media files are disabled in preview mode." : "Los enlaces a archivos multimedia están deshabilitados en el modo de vista previa.",
    "Wiki-page %1$s has been renamed to %2$s." : "La página del wiki %1$s ha sido renombrada a %2$s.",
    "Renaming of wiki-page %1$s to %2$s failed." : "Error al cambiar el nombre de la página del wiki %1$s a %2$s."
},"pluralForm" :"nplurals=3; plural=n == 1 ? 0 : n != 0 && n % 1000000 == 0 ? 1 : 2;"
}