{ "translations": {
    "Unknown admin setting: \"%1$s\"" : "Socrú riaracháin anaithnid: \"%1$s\"",
    "The admin setting \"%1$s\" is read-only" : "Tá an socrú riaracháin \"%1$s\" inléite amháin",
    "Scheme of external URL must be one of \"http\" or \"https\", but nothing was specified." : "Ní mór go mbeadh scéim an URL seachtrach mar cheann de \"http\" nó \"https\", ach níor sonraíodh aon rud.",
    "Scheme of external URL must be one of \"http\" or \"https\", \"%s\" given." : "Caithfidh scéim an URL sheachtrach a bheith mar cheann de \"http\" nó \"https\", \"%s\" tugtha.",
    "Host-part of external URL seems to be empty" : "Is cosúil go bhfuil cuid óstach de URL seachtrach folamh",
    "Value \"%1$s\" for setting \"%2$s\" is either not convertible to integer or out of range (minimum is %d seconds)." : "Níl luach \"%1$s\" chun \"%2$s\" a shocrú in-chomhshóite go slánuimhir nó as raon (is é %d soicind ar a laghad).",
    "Value \"%1$s\" for setting \"%2$s\" is not convertible to boolean." : "Ní féidir luach \"%1$s\" chun \"%2$s\" a shocrú go Boole.",
    "true" : "fíor",
    "false" : "bréagach",
    "DokuWiki Integration" : "Comhtháthú DokuWiki",
    "Installation problem; the required resource \"%1$s\" of type \"%2$s\" is not installed on the server, please contact the system administrator!" : "Fadhb suiteála; níl an acmhainn riachtanach \"%1$s\" de chineál \"%2$s\" suiteáilte ar an bhfreastalaí, téigh i dteagmháil le riarthóir an chórais!",
    "User" : "Úsáideoir",
    "Password" : "Pasfhocal",
    "Login succeeded." : "D'éirigh leis an logáil isteach.",
    "Login failed." : "Theip ar logáil isteach.",
    "Error, caught an exception." : "Earráid, ghlac eisceacht.",
    "Caused by previous exception" : "De bharr eisceachta roimhe seo",
    "%1$s (renamed)" : "%1$s (athainmnithe)",
    "renamed file" : "comhad athainmnithe",
    "Unable to sanitize filename \"%s\"." : "Ní féidir ainm comhaid \"%s\" a shláintiú.",
    "DokuWiki" : "DokuWiki",
    "Embed an existing DokuWiki instance into Nextcloud, potentially with SSO." : "Leabaigh sampla DokuWiki atá ann cheana féin i Nextcloud, le SSO b’fhéidir.",
    "Embed an existing DokuWiki instance into Nextcloud, potentially with SSO. For SSO DokuWiki users and Nextcloud users have to coincide, e.g. by using a common authentication backend like LDAP, or with an appropriate auth plugin on either side of the integration." : "Leabaigh sampla DokuWiki atá ann cheana féin i Nextcloud, le SSO b’fhéidir. Maidir le húsáideoirí SSO DokuWiki agus caithfidh úsáideoirí Nextcloud dul i gcomhthráth, e.g. trí úsáid a bhaint as inneall fíordheimhnithe comónta cosúil le LDAP, nó le breiseán údaraithe cuí ar gach taobh den chomhtháthú.",
    "DokuWiki Installation Path" : "Conair Suiteála DokuWiki",
    "Please enter the location of the already installed DokuWiki instance. This should either be a path, absolute or relative to the root of the web server, or a complete URL pointing to the web location of the DokuWiki. In order to make things work, your have to enable the XML-RPC protocol in your DokuWiki." : "Cuir isteach suíomh an ásc DokuWiki atá suiteáilte cheana féin le do thoil. Ba cheart go mbeadh sé seo ina chonair, absalóideach nó i gcoibhneas le fréamh an fhreastalaí gréasáin, nó URL iomlán ag díriú ar shuíomh gréasáin an DokuWiki. Le go n-oibreoidh rudaí, caithfidh tú an prótacal XML-RPC a chumasú i do DokuWiki.",
    "DokuWiki Session Refresh Interval [s]" : "Eatramh Athnuachan Seisiún DokuWiki[s]",
    "Please enter the desired session-refresh interval here. The interval is measured in seconds and should be somewhat smaller than the configured session life-time for the DokuWiki instance in use." : "Cuir isteach an t-eatramh seisiúin-athnuachan atá uait anseo le do thoil. Déantar an t-eatramh a thomhas i soicindí agus ba chóir go mbeadh sé beagán níos lú ná an t-am a bheidh socraithe don seisiún DokuWiki atá in úsáid.",
    "Disable SSL verification, e.g. for self-signed certificates or known mis-matching host-names like 'localhost'." : "Díchumasaigh fíorú SSL, e.g. le haghaidh deimhnithe féin-shínithe nó óstainmneacha mímheaitseála aitheanta amhail ‘localhost’.",
    "Enable SSL verification." : "Cumasaigh fíorú SSL.",
    "DokuWiki Wrapper for Nextcloud" : "Fillteán DokuWiki do Nextcloud",
    "Unable to access the contents of the wrapped {wrappedApp} instance.\nThis may be caused by cross-domain access restrictions.\nPlease check that your Nextcloud instance ({nextcloudUrl}) and the wrapped {wrappedApp} instance ({iFrameUrl}) are served from the same domain." : "Ní féidir rochtain a fháil ar ábhar an tsampla fillte {wrappedApp}.\nD’fhéadfadh srianta rochtana tras-fhearainn a bheith ina gcúis leis seo.\nSeiceáil le do thoil go bhfuil do chás Nextcloud ({nextcloudUrl}) agus an tsampla fillte {wrappedApp} ({iFrameUrl}) á bhfreastal ón bhfearann ​​​​céanna.",
    "Link to wiki page \"{href}\"" : "Nasc le leathanach vicí \"{href}\"",
    "Links to wiki pages are disabled in preview mode." : "Díchumasaítear naisc le leathanaigh vicí sa mhód réamhamhairc.",
    "Links to media files are disabled in preview mode." : "Tá naisc le comhaid meán díchumasaithe i mód réamhamhairc."
},"pluralForm" :"nplurals=5; plural=(n==1 ? 0 : n==2 ? 1 : n<7 ? 2 : n<11 ? 3 : 4);"
}