{ "translations": {
    "Unknown admin setting: \"%1$s\"" : "Ismeretlen rendszergazdai beállítás: „%1$s”",
    "The admin setting \"%1$s\" is read-only" : "A rendszergazdai beállítás csak olvasható: „%1$s”",
    "Scheme of external URL must be one of \"http\" or \"https\", but nothing was specified." : "A külső webcím sémájának „http”-nek vagy „https”-nek kellene lennie, de semmi sem lett megadva.",
    "Scheme of external URL must be one of \"http\" or \"https\", \"%s\" given." : "A külső webcím sémájának „http”-nek vagy „https”-nek kellene lennie, de „%s” lett megadva.",
    "Host-part of external URL seems to be empty" : "A külső webcím kiszolgáló része üresnek tűnik",
    "Value \"%1$s\" for setting \"%2$s\" is either not convertible to integer or out of range (minimum is %d seconds)." : "A(z) „%2$s” beállítás „%1$s” értéke nem alakítható egész számmá, vagy az értelmezési tartományon kívül esik (legalább %d másodpercnek kell lennie).",
    "Value \"%1$s\" for setting \"%2$s\" is not convertible to boolean." : "A(z) „%2$s” beállítás „%1$s” értéke nem alakítható logikai értékké.",
    "true" : "igaz",
    "false" : "hamis",
    "DokuWiki Integration" : "DokuWiki integráció",
    "Installation problem; the required resource \"%1$s\" of type \"%2$s\" is not installed on the server, please contact the system administrator!" : "Telepítési probléma; a kért „%1$s” „%2$s” típusú erőforrás nincs a kiszolgálóra telepítve, lépjen kapcsolatba a rendszergazdával.",
    "User" : "Felhasználó",
    "Password" : "Jelszó",
    "Login succeeded." : "Belépés sikeres.",
    "Login failed." : "Belépés sikertelen.",
    "Error, caught an exception." : "Hiba, kivétel történt.",
    "Caused by previous exception" : "Az előző kivétel okozta",
    "%1$s (renamed)" : "%1$s (átnevezve)",
    "renamed file" : "átnevezett fájl",
    "DokuWiki" : "DokuWiki",
    "Embed an existing DokuWiki instance into Nextcloud, potentially with SSO." : "Egy meglévő DokuWiki-példány beágyazása a Nextcloudba, akár egyszeri bejelentkezéssel (SSO-val).",
    "Embed an existing DokuWiki instance into Nextcloud, potentially with SSO. For SSO DokuWiki users and Nextcloud users have to coincide, e.g. by using a common authentication backend like LDAP, or with an appropriate auth plugin on either side of the integration." : "Ágyazzon be egy meglévő DokuWiki-példányt a Nextcloudba, akár egyszeri bejelentkezéssel (SSO-val). Az SSO működéséhez a DokuWiki és a Nextcloud felhasználóknak egybe kell esniük, ez például egy közös hitelesítési háttérrendszerrel oldható meg, mint az LDAP, vagy egy megfelelő hitelesítési bővítménnyel az integráció egyik oldalán.",
    "DokuWiki Installation Path" : "DokuWiki telepítési útvonala",
    "Please enter the location of the already installed DokuWiki instance. This should either be a path, absolute or relative to the root of the web server, or a complete URL pointing to the web location of the DokuWiki. In order to make things work, your have to enable the XML-RPC protocol in your DokuWiki." : "Adja meg a már telepített DokuWiki-példány helyét. Ennek abszolút elérési útnak, a webkiszolgáló gyökerétől számított relatív elérési útnak, vagy a DokuWiki helyére mutató teljes webcímnek kell lennie. Hogy a dolgok működjenek, engedélyeznie kell az XML-RPC protokollt a DokuWikiben.",
    "DokuWiki Session Refresh Interval [s]" : "DokuWiki munkamenet-megújítási intervalluma [s]",
    "Please enter the desired session-refresh interval here. The interval is measured in seconds and should be somewhat smaller than the configured session life-time for the DokuWiki instance in use." : "Adja meg itt a kívánt munkamenet-megújítási intervallumot. Az intervallum másodpercben mért, és valamivel kisebbnek kell lennie, mint a DokuWiki-példányon beállított munkamenet-élettartam.",
    "Disable SSL verification, e.g. for self-signed certificates or known mis-matching host-names like 'localhost'." : "SSL-ellenőrzés letiltása, például önaláírt tanúsítványok vagy nem egyező kiszolgálónevek (például „localhost”) használatához.",
    "Enable SSL verification." : "SSL-ellenőrzés engedélyezése.",
    "Links to wiki pages are disabled in preview mode." : "A wiki oldalakra mutató hivatkozások le vannak tiltva az előnézeti módban.",
    "Links to media files are disabled in preview mode." : "A médiafájlokra mutató hivatkozások le vannak tiltva az előnézeti módban."
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}