{ "translations": {
    "Unknown admin setting: \"%1$s\"" : "Configuração administrativa desconhecida: \"%1$s\"",
    "The admin setting \"%1$s\" is read-only" : "A configuração administrativa \"%1$s\" é somente leitura",
    "Scheme of external URL must be one of \"http\" or \"https\", but nothing was specified." : "O esquema do URL externo deve ser \"http\" ou \"https\", mas nada foi especificado.",
    "Scheme of external URL must be one of \"http\" or \"https\", \"%s\" given." : "O esquema do URL externo deve ser \"http\" ou \"https\", \"%s\" fornecido.",
    "Host-part of external URL seems to be empty" : "A parte do host do URL externo parece estar vazia",
    "Value \"%1$s\" for setting \"%2$s\" is either not convertible to integer or out of range (minimum is %d seconds)." : "O valor \"%1$s\" para configuração \"%2$s\" não pode ser convertido para um número inteiro ou está fora do intervalo (o mínimo é %d segundos).",
    "Value \"%1$s\" for setting \"%2$s\" is not convertible to boolean." : "Valor \"%1$s\" para a configuração \"%2$s\" não é conversível em boolean.",
    "true" : "verdadeiro",
    "false" : "falso",
    "DokuWiki Integration" : "Integração DokuWiki",
    "Exactly one of query-parameters \"%1$s\" and \"%2$s\" have to be specified." : "É necessário especificar exatamente um dos parâmetros de consulta \"%1$s\" e \"%2$s\".",
    "Unable to find the entity \"%1$s\" identified by \"%2$s\"." : "Não foi possível encontrar a entidade \"%1$s\" identificada por \"%2$s\".",
    "Unable to determine the identifier values for an instance of \"%s\"." : "Não foi possível determinar os valores do identificador para um instância de \"%s\".",
    "Collection \"%1$s\" in entity of type \"%2$s\" is null." : "A coleção \"%1$s\" na entidade do tipo \"%2$s\" é null.",
    "Unable to compute a serialization for an instance of \"%s\"." : "Não é possível calcular uma serialização para uma instância de \"%s\".",
    "Installation problem; the required resource \"%1$s\" of type \"%2$s\" is not installed on the server, please contact the system administrator!" : "Problema de instalação; o recurso necessário \"%1$s\" do tipo \"%2$s\" não está instalado no servidor, entre em contato com o administrador do sistema!",
    "User" : "Usuário",
    "Password" : "Senha",
    "Login succeeded." : "Login bem-sucedido.",
    "Login failed." : "Falha no login.",
    "%1$s (renamed)" : "%1$s (renomeado)",
    "renamed file" : "arquivo renomeado",
    "Unable to sanitize filename \"%s\"." : "Não foi possível limpar o nome do arquivo \"%s\".",
    "DokuWiki" : "DokuWiki",
    "Embed an existing DokuWiki instance into Nextcloud, potentially with SSO." : "Incorpore uma instância existente do DokuWiki no Nextcloud, possivelmente com SSO.",
    "Embed an existing DokuWiki instance into Nextcloud, potentially with SSO. For SSO DokuWiki users and Nextcloud users have to coincide, e.g. by using a common authentication backend like LDAP, or with an appropriate auth plugin on either side of the integration." : "Incorpore uma instância existente do DokuWiki no Nextcloud, possivelmente com SSO. Para o SSO, os usuários do DokuWiki e os usuários do Nextcloud precisam coincidir, p. ex., usando um back-end de autenticação comum, como LDAP, ou com um plug-in de autenticação apropriado em ambos os lados da integração.",
    "DokuWiki Installation Path" : "Caminho de Instalação do DokuWiki",
    "Please enter the location of the already installed DokuWiki instance. This should either be a path, absolute or relative to the root of the web server, or a complete URL pointing to the web location of the DokuWiki. In order to make things work, your have to enable the XML-RPC protocol in your DokuWiki." : "Por favor, digite o local da instância do DokuWiki já instalada. Isso deve ser um caminho, absoluto ou relativo à raiz do servidor web, ou um URL completo apontando para o local do DokuWiki na Web. Para que as coisas funcionem, você precisa ativar o protocolo XML-RPC em seu DokuWiki.",
    "DokuWiki Session Refresh Interval [s]" : "Intervalo de Atualizações da Sessão do DokuWiki [s]",
    "Please enter the desired session-refresh interval here. The interval is measured in seconds and should be somewhat smaller than the configured session life-time for the DokuWiki instance in use." : "Por favor, insira aqui o intervalo de atualização de sessão desejado. O intervalo é medido em segundos e deve ser um pouco menor do que o tempo de vida da sessão configurada para a instância DokuWiki em uso.",
    "Disable SSL verification, e.g. for self-signed certificates or known mis-matching host-names like 'localhost'." : "Desative a verificação SSL, p. ex., para certificados autoassinados ou nomes de host incompatíveis conhecidos, como 'localhost'.",
    "Enable SSL verification." : "Ativar a verificação SSL.",
    "DokuWiki Wrapper for Nextcloud" : "Wrapper do DokuWiki para o Nextcloud",
    "Unable to access the contents of the wrapped {wrappedApp} instance.\nThis may be caused by cross-domain access restrictions.\nPlease check that your Nextcloud instance ({nextcloudUrl}) and the wrapped {wrappedApp} instance ({iFrameUrl}) are served from the same domain." : "Não é possível acessar o conteúdo da instância {wrappedApp} embrulhada.\nIsso pode ser causado por restrições de acesso entre domínios.\nVerifique se a instância Nextcloud ({nextcloudUrl}) e a instância {wrappedApp} embrulhada ({iFrameUrl}) são servidas a partir do mesmo domínio.",
    "Link to wiki page \"{href}\"" : "Link para a página wiki \"{href}\"",
    "Links to wiki pages are disabled in preview mode." : "Os links para páginas wiki são desativados no modo de visualização.",
    "Links to media files are disabled in preview mode." : "Os links para arquivos de mídia são desativados no modo de visualização.",
    "Error, caught an exception." : "Erro, capturou uma exceção.",
    "Caused by previous exception" : "Causado por uma exceção anterior"
},"pluralForm" :"nplurals=3; plural=(n == 0 || n == 1) ? 0 : n != 0 && n % 1000000 == 0 ? 1 : 2;"
}