{ "translations": {
    "Unknown admin setting: \"%1$s\"" : "Neznáme nastavenie administrátora: \"%1$s\"",
    "The admin setting \"%1$s\" is read-only" : "Nastavenie administrátora \"%1$s\" je iba na čítanie",
    "Scheme of external URL must be one of \"http\" or \"https\", but nothing was specified." : "Schéma externej adresy URL musí byť buď „http“ alebo „https“, ale nebolo zadané nič.",
    "Scheme of external URL must be one of \"http\" or \"https\", \"%s\" given." : "Schéma externej adresy URL musí byť buď „http“ alebo „https“, bolo zadané \"%s\".",
    "Host-part of external URL seems to be empty" : "Hostiteľská časť externej adresy URL sa zdá byť prázdna",
    "Value \"%1$s\" for setting \"%2$s\" is either not convertible to integer or out of range (minimum is %d seconds)." : "Hodnota \"%1$s\" pre nastavenie \"%2$s\" buď nie je konvertibilná na celé číslo alebo je mimo rozsahu (minimum sú %d sekundy).",
    "Value \"%1$s\" for setting \"%2$s\" is not convertible to boolean." : "Hodnota \"%1$s\" pre nastavenie \"%2$s\" nie je konvertibilná na boolovskú hodnotu.",
    "true" : "pravda",
    "false" : "nepravda",
    "DokuWiki Integration" : "Integrácia DokuWiki",
    "Installation problem; the required resource \"%1$s\" of type \"%2$s\" is not installed on the server, please contact the system administrator!" : "Problém s inštaláciou; požadovaný zdroj \"%1$s\" typu \"%2$s\" nie je nainštalovaný na serveri, kontaktujte správcu systému!",
    "User" : "Používateľ",
    "Password" : "Heslo",
    "Login succeeded." : "Prihlásenie bolo úspešné.",
    "Login failed." : "Prihlásenie zlyhalo.",
    "%1$s (renamed)" : "%1$s (premenovaný)",
    "renamed file" : "premenovaný súbor",
    "DokuWiki" : "DokuWiki",
    "Embed an existing DokuWiki instance into Nextcloud, potentially with SSO." : "Vložte existujúcu inštanciu DokuWiki do Nextcloud, potenciálne s SSO.",
    "Embed an existing DokuWiki instance into Nextcloud, potentially with SSO. For SSO DokuWiki users and Nextcloud users have to coincide, e.g. by using a common authentication backend like LDAP, or with an appropriate auth plugin on either side of the integration." : "Vložte existujúcu inštanciu DokuWiki do Nextcloud, potenciálne s SSO. Pre SSO sa užívatelia DokuWiki a Nextcloud musia zhodovať, napr. pomocou bežného overovacieho backendu, ako je LDAP, alebo s vhodným auth pluginom na oboch stranách integrácie.",
    "DokuWiki Installation Path" : "Cesta k inštalácii DokuWiki",
    "Please enter the location of the already installed DokuWiki instance. This should either be a path, absolute or relative to the root of the web server, or a complete URL pointing to the web location of the DokuWiki. In order to make things work, your have to enable the XML-RPC protocol in your DokuWiki." : "Zadajte umiestnenie už nainštalovanej inštancie DokuWiki. Mala by to byť cesta, buď absolútna alebo relatívna ku koreňovému adresáru webového servera, alebo úplná adresa URL smerujúca na webové umiestnenie DokuWiki. Aby veci fungovali, musíte vo svojej DokuWiki povoliť protokol XML-RPC.",
    "DokuWiki Session Refresh Interval [s]" : "Interval obnovenia relácie DokuWiki [s]",
    "Please enter the desired session-refresh interval here. The interval is measured in seconds and should be somewhat smaller than the configured session life-time for the DokuWiki instance in use." : "Tu zadajte požadovaný interval obnovenia relácie. Interval sa meria v sekundách a mal by byť o niečo menší ako nakonfigurovaná životnosť relácie pre používanú inštanciu DokuWiki.",
    "Disable SSL verification, e.g. for self-signed certificates or known mis-matching host-names like 'localhost'." : "Zakázať overenie SSL, napr. pre certifikáty s vlastným podpisom alebo známe nezhodné názvy hostiteľov, ako napríklad „localhost“.",
    "Enable SSL verification." : "Zapnúť verifikáciu SSL.",
    "DokuWiki Wrapper for Nextcloud" : "DokuWiki Wrapper pre Nextcloud",
    "Link to wiki page \"{href}\"" : "Odkaz na wiki stránku \"{href}\"",
    "Links to wiki pages are disabled in preview mode." : "Odkazy na stránky wiki sú v režime ukážky zakázané.",
    "Links to media files are disabled in preview mode." : "Odkazy na súbory médií sú v režime ukážky zakázané.",
    "Error, caught an exception." : "Chyba, vyskytla sa výnimka.",
    "Caused by previous exception" : "Spôsobené predchádzajúcou výnimkou"
},"pluralForm" :"nplurals=4; plural=(n % 1 == 0 && n == 1 ? 0 : n % 1 == 0 && n >= 2 && n <= 4 ? 1 : n % 1 != 0 ? 2: 3);"
}