{ "translations": {
    "Unknown admin setting: \"%1$s\"" : "Непознато админ подешавање: „%1$s",
    "The admin setting \"%1$s\" is read-only" : "Админ подешавање „%1$s” може само да се чита",
    "Scheme of external URL must be one of \"http\" or \"https\", but nothing was specified." : "Схема спољне URL мора бити једно од „http” или „https”, али ништа није наведено.",
    "Scheme of external URL must be one of \"http\" or \"https\", \"%s\" given." : "Схема спољне URL мора бити једно од „http” или „https”, наведено је „%s”.",
    "Host-part of external URL seems to be empty" : "Изгледа да је хост део спољне URL празан",
    "Value \"%1$s\" for setting \"%2$s\" is either not convertible to integer or out of range (minimum is %d seconds)." : "Вредност „%1$s” подешавања „%2$s” или не може да се претвори у цео број или је ван опсега (минимум је %d секунди).",
    "Value \"%1$s\" for setting \"%2$s\" is not convertible to boolean." : "Вредност „%1$s” подешавања „%2$s” не може да се претвори у логичку вредност.",
    "true" : "истинито",
    "false" : "неистинито",
    "DokuWiki Integration" : "DokuWiki интеграција",
    "Installation problem; the required resource \"%1$s\" of type \"%2$s\" is not installed on the server, please contact the system administrator!" : "Проблем при инсталацији; на сервер није инсталиран потребан ресурс „%1$s” типа „%2$s”, молимо вас да се обратите администратору система!",
    "User" : "Корисник",
    "Password" : "Лозинка",
    "Login succeeded." : "Пријава је успела.",
    "Login failed." : "Није успела пријава.",
    "Error, caught an exception." : "Грешка, ухваћен је изузетак.",
    "Caused by previous exception" : "Изазвао је претходни изузетак",
    "DokuWiki" : "DokuWiki",
    "Embed an existing DokuWiki instance into Nextcloud, potentially with SSO." : "Уградите постојећу DokuWiki инстанцу у Nextcloud, потенцијално са SSO.",
    "Embed an existing DokuWiki instance into Nextcloud, potentially with SSO. For SSO DokuWiki users and Nextcloud users have to coincide, e.g. by using a common authentication backend like LDAP, or with an appropriate auth plugin on either side of the integration." : "Уградите постојећу DokuWiki инстанцу у Nextcloud, потенцијално са SSO. Да би се  SSO DokuWiki корисници и Nextcloud корисници подударали, нпр. употребом заједничког позадинског механизма за аутентификацију, као што је LDAP, или одговарајућег додататка аутентификације са обе стране интеграције.",
    "DokuWiki Installation Path" : "Путања DokuWiki инсталације",
    "Please enter the location of the already installed DokuWiki instance. This should either be a path, absolute or relative to the root of the web server, or a complete URL pointing to the web location of the DokuWiki. In order to make things work, your have to enable the XML-RPC protocol in your DokuWiki." : "Молимо вас да унесете локацију већ инсталиране DokuWiki инстанце. То би требало да буде или путања, апсолутна или релативна у односу на корен веб сервера, или комплетан URL који показује на веб локацију DokuWiki сервера. Да би све функционисало како треба, потребно је да на свом DokuWiki серверу укључите XML-RPC протокол.",
    "DokuWiki Session Refresh Interval [s]" : "Интервал одвежавања DokuWiki сесије [s]",
    "Please enter the desired session-refresh interval here. The interval is measured in seconds and should be somewhat smaller than the configured session life-time for the DokuWiki instance in use." : "Молимо вас да овде унесете жељени интервал освежавања сесије. Интервал се мерии у секундама и требало би да буде мало мањи од конфигурисаног времена живота сесије DokuWiki инстанце која се користи.",
    "Disable SSL verification, e.g. for self-signed certificates or known mis-matching host-names like 'localhost'." : "Искључи SSL потврђивање, нпр. за самостално потписане сертификате или позната имена хостова која се не подударају са сертификатом, као што је ’localhost.",
    "Enable SSL verification." : "Укључи SSL потврђивање.",
    "Unknown error :(" : "Непозната грешка :(",
    "Error" : "Грешка",
    "Links to wiki pages are disabled in preview mode." : "Линкови на вики странице су искључени у режиму прегледа.",
    "Link to wiki page" : "Линк на вики страницу",
    "Links to media files are disabled in preview mode." : "Линкови на фајлове медија су искључени у режиму прегледа."
},"pluralForm" :"nplurals=3; plural=(n%10==1 && n%100!=11 ? 0 : n%10>=2 && n%10<=4 && (n%100<10 || n%100>=20) ? 1 : 2);"
}