{ "translations": {
    "Unknown admin setting: \"%1$s\"" : "Mpangilio wa msimamizi usiojulikana: \"%1$s\"",
    "The admin setting \"%1$s\" is read-only" : "Mipangilio ya msimamizi \"%1$s\" ni ya kusoma tu",
    "Scheme of external URL must be one of \"http\" or \"https\", but nothing was specified." : "Mpango wa URL ya nje lazima uwe wa \"http\" au \"https\", lakini hakuna kilichobainishwa.",
    "Scheme of external URL must be one of \"http\" or \"https\", \"%s\" given." : "Mpango wa URL ya nje lazima iwe mojawapo ya \"http\" au \"https\", \"%s\" zilizotolewa.",
    "Host-part of external URL seems to be empty" : "Sehemu ya seva pangishi ya URL ya nje inaonekana kuwa tupu",
    "Value \"%1$s\" for setting \"%2$s\" is either not convertible to integer or out of range (minimum is %d seconds)." : "Thamani \"%1$s\" ya kuweka \"%2$s\" haiwezi kubadilishwa kuwa nambari kamili au nje ya masafa (kiwango cha chini ni sekunde %d).",
    "Value \"%1$s\" for setting \"%2$s\" is not convertible to boolean." : "Thamani \"%1$s\" ya kuweka \"%2$s\" haiwezi kubadilishwa kuwa boolean.",
    "true" : "kweli",
    "false" : "si kweli",
    "DokuWiki Integration" : "Ushirikiano wa DokuWiki",
    "Installation problem; the required resource \"%1$s\" of type \"%2$s\" is not installed on the server, please contact the system administrator!" : "Tatizo la ufungaji; rasilimali inayohitajika \"%1$s\" ya aina \"%2$s\" haijasakinishwa kwenye seva, tafadhali wasiliana na msimamizi wa mfumo!",
    "User" : "Mtumiaji",
    "Password" : "Nenosiri",
    "Login succeeded." : "Uingiaji umefanikiwa",
    "Login failed." : "Uingiaji umeshindikana",
    "%1$s (renamed)" : "%1$s (iliyopew jina jipya)",
    "renamed file" : "Faili iliyopewa jina jipya",
    "Unable to sanitize filename \"%s\"." : "Haiwezi kutakasa jina la faili \"%s\".",
    "DokuWiki" : "DokuWiki",
    "Embed an existing DokuWiki instance into Nextcloud, potentially with SSO." : "Pachika mfano uliopo wa DokuWiki kwenye Nextcloud, ikiwezekana ukitumia SSO.",
    "Embed an existing DokuWiki instance into Nextcloud, potentially with SSO. For SSO DokuWiki users and Nextcloud users have to coincide, e.g. by using a common authentication backend like LDAP, or with an appropriate auth plugin on either side of the integration." : "Pachika mfano uliopo wa DokuWiki kwenye Nextcloud, ikiwezekana ukitumia SSO. Kwa watumiaji wa SSO DokuWiki na watumiaji wa Nextcloud lazima walandane, k.m. kwa kutumia uthibitishaji wa kawaida wa nyuma kama LDAP, au na programu-jalizi inayofaa ya uthibitishaji kwa kila upande wa muunganisho.",
    "DokuWiki Installation Path" : "Usanidi wa njia ya DokuWiki",
    "Please enter the location of the already installed DokuWiki instance. This should either be a path, absolute or relative to the root of the web server, or a complete URL pointing to the web location of the DokuWiki. In order to make things work, your have to enable the XML-RPC protocol in your DokuWiki." : "Tafadhali weka eneo la tukio ambalo tayari limesakinishwa la DokuWiki. Hii inapaswa kuwa njia, kamili au inayohusiana na mzizi wa seva ya wavuti, au URL kamili inayoelekeza eneo la wavuti la DokuWiki. Ili kufanya mambo yafanye kazi, ni lazima uwashe itifaki ya XML-RPC katika DokuWiki yako.",
    "DokuWiki Session Refresh Interval [s]" : "Kipindi cha Kuonyesha Kipindi cha DokuWiki [s]",
    "Please enter the desired session-refresh interval here. The interval is measured in seconds and should be somewhat smaller than the configured session life-time for the DokuWiki instance in use." : "Tafadhali weka muda unaotaka wa kuonyesha upya kipindi hapa. Muda hupimwa kwa sekunde na unapaswa kuwa mdogo kwa kiasi fulani kuliko kipindi cha maisha kilichosanidiwa kwa mfano wa DokuWiki unaotumika.",
    "Disable SSL verification, e.g. for self-signed certificates or known mis-matching host-names like 'localhost'." : "Zima uthibitishaji wa SSL, k.m. kwa vyeti vya kujiandikisha au majina ya wapangishi yasiyolingana kama vile 'localhost'.",
    "Enable SSL verification." : "Washa uthibitishaji wa SSL",
    "DokuWiki Wrapper for Nextcloud" : "DokuWiki Wrapper ya Nextcloud",
    "Unable to access the contents of the wrapped {wrappedApp} instance.\nThis may be caused by cross-domain access restrictions.\nPlease check that your Nextcloud instance ({nextcloudUrl}) and the wrapped {wrappedApp} instance ({iFrameUrl}) are served from the same domain." : "Imeshindwa kufikia maudhui ya mfano uliofungwa wa {wrappedApp}.\nHii inaweza kusababishwa na vikwazo vya ufikiaji wa vikoa tofauti.\nTafadhali hakikisha kuwa mfano wako wa Nextcloud ({nextcloudUrl}) na mfano uliofungwa wa {wrappedApp} ({iFrameUrl}) vinatolewa kutoka kwa kikoa sawa.",
    "Link to wiki page \"{href}\"" : " Unganisha kwenye ukurasa wa wiki \"{href}\"",
    "Links to wiki pages are disabled in preview mode." : " Viungo vya kurasa za wiki vimezimwa katika hali ya onyesho la kukagua.",
    "Links to media files are disabled in preview mode." : "Viungo vya faili za midia vimezimwa katika hali ya onyesho la kukagua."
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}